<template>
  <dx-circular-gauge :value="value">
    <dx-size
      :width="60"
      :height="90"
    />
    <dx-value-indicator/>
    <dx-geometry
      :start-angle="startAngle"
      :end-angle="endAngle"
    />
    <dx-scale
      :start-value="!inverted ? 0 : 100"
      :end-value="!inverted ? 100 : 0"
      :tick-interval="10"
    />
    <dx-range-container >
      <dx-range  ></dx-range>
      <dx-range  ></dx-range>
    </dx-range-container>
  </dx-circular-gauge>
</template>
<script>

  import DxCircularGauge, {
    DxSize,
    DxValueIndicator,
    DxGeometry,
    DxScale,

    DxRangeContainer,
    DxRange
  } from 'devextreme-vue/circular-gauge';

  export default {
    components: {
      DxCircularGauge,
      DxSize,
      DxValueIndicator,
      DxGeometry,
      DxScale,

      DxRangeContainer,
      DxRange

    },
    props: {
      value: {
        type: Number,
        default: 0
      },
      startAngle: {
        type: Number,
        default: 0
      },
      endAngle: {
        type: Number,
        default: 90
      },
      inverted: {
        type: Boolean,
        default: true
      }
    }
  };
</script>



<!--Αν έχετε Σελήνη στο Ζυγό στο γενέθλιο χάρτη σας, προσπαθείτε να ανακαλύψετε τον εαυτό σας με τη μέθοδο της δοκιμής και επιδιώκετε να μοιραστείτε εμπειρίες με άλλους σε κάθε ευκαιρία. Έχετε μια χαλαρή, χαριτωμένη, ευγενική φυσιογνωμία και μια βαθιά ανάγκη να αρέσετε στους άλλους. Διαθέτετε αβρότητα, χάρη και διπλωματία, ενώ η συναισθηματική σας κατάσταση εξαρτάται από την έγκριση των άλλων και έτσι δεν χάνετε την ευκαιρία να προσφέρετε ευχαρίστηση.-->

<!--Τείνετε να ζείτε για τη στιγμή και με κάθε μεταβολή των γεγονότων η διάθεσή σας ανεβοκατεβαίνει. Παρ' όλο που είστε φιλικοί, ανάλαφροι και δημοφιλείς, αν χρησιμοποιήσετε αυτή την Σελήνη αρνητικά, μπορεί να εμφανίζεστε καπριτσιόζοι, άστατοι και επικριτικοί. Επειδή υποκύπτετε εύκολα στην κολακεία και θέλετε να τα έχετε καλά με όλους, έχετε μεγάλη "αυλή" από άτομα που σας δίνουν τρυφερότητα κάθε ημέρα. Πρέπει συνειδητά να γίνετε αυτοδύναμοι και να μάθετε να λέτε "όχι", όπως, επίσης, να περιορίσετε τις τάσεις για νωθρότητα και φλερτάρισμα.-->

<!--Διαθέτετε άψογη αισθητική και νοιώθετε την ανάγκη να εξυπηρετείτε την ομορφιά. Βιώνετε τις αισθήσεις μέσα από το μυαλό αλλά δεν αναλύετε, ούτε κριτικάρετε. Επειδή έχετε να κάνετε με την αέρινη φύση λόγω του ζωδίου του Ζυγού είστε συνέχεια παραδομένοι σε στοχασμούς. Δημιουργείτε μεγάλες ιδέες, αλλά δεν είστε πάντα έτοιμοι να τις πραγματώσετε. Για σας η κρίση είναι πιο σπουδαία από την εκτέλεση.-->

<!--Δεν έχετε μεγάλη αποφασιστικότητα, αλλά η γλυκύτητά σας είναι απατηλή και κρύβει μεγάλη δύναμη. Συχνά, σας αρέσει η μουσική, η ποίηση και η τέχνη, αλλά παρ' όλο που έχετε ικανότητα σε αυτούς τους τομείς, προτιμάτε να τα απολαμβάνετε, παρά να καταπιαστείτε με αυτά. Πάντως με αυτή την Σελήνη γεννήθηκαν πολύ μεγάλοι καλλιτέχνες.-->

<!--Τρυφεροί και καλοκάγαθοι, είστε περιζήτητοι στους κοινωνικούς κύκλους. Οι άνθρωποι σάς επηρεάζουν και η ερωτική σας ζωή εξαρτάται από το πόσο σας εκτιμούν. Οι σύντροφοι/συνέταιροι/συνεργάτες είναι σημαντικοί, μιας και δουλεύετε καλύτερα σε συνδυασμό με άλλους, και επειδή βασίζεστε στη γνώμη τους και τις αντιδράσεις τους.-->

<!--Ο άντρας με Σελήνη στον Ζυγό μπορεί να ψάχνει μια εκλεπτυσμένη, κοινωνική και όμορφη σύζυγο που της αρέσει η διασκέδαση και η οποία θα είναι ελκυστική, περιποιημένη, κοινωνική και έξυπνη.-->

<!--Η γυναίκα με Σελήνη στον Ζυγό είναι  κομψή και η ομορφιά παίζει πολύ μεγάλο ρόλο στη ζωή της γι’ αυτό ασχολείται συνέχεια με την εμφάνισή της και την ανησυχούν τα σημάδια του χρόνου πάνω της. Είναι κοινωνική, διπλωμάτης, καλή οικοδέσποινα, και της αρέσει το όμορφο περιβάλλον, το ντεκόρ και τα καλά ρούχα.-->

<!--Γενικά, είστε άτομα λαμπερά και πολύ αγαπητά από τον κόσμο, γι’ αυτό τα επαγγέλματα που διαλέγετε συνήθως είναι κοινωνικά ή καλλιτεχνικά για να έχετε την επαφή και την αναγνώριση από τους πολλούς και όχι από λίγα άτομα γιατί αλλιώς νοιώθετε μοναξιά. Είναι απαραίτητο όμως να μάθετε να αποδέχεστε τον εαυτό σας και να μένετε ακόμα και μόνοι για κάποια διαστήματα γιατί με αυτόν τον τρόπο θα δυναμώσετε και θα γίνετε περισσότερο πνευματικοί. Βλέπετε την μητέρα σας σαν ένα πρόσωπο που έδωσε μεγάλη έμφαση στους τρόπους και τη συμπεριφορά σας και προσπάθησε να σας παρέχει κίνητρα για να αναγνωρίζετε την ομορφιά και την αρμονία, είτε καλλιτεχνική  είτε φυσική.-->




<!--Πέμπτη 13 Δεκέμβρη. Η σύρια πρόσφυγας Sara Mardini και ο γερμανός εθελοντής Sean Binder (μαζί με δυο ακόμα έλληνες) που είχαν προφυλακιστεί εδώ και κάποιους μήνες κατηγορούμενοι «για παράνομη διακίνηση ανθρώπων» αποφυλακίστηκαν μεν (καταβάλλοντας «εγγυήσεις») μέχρι να γίνει η δίκη τους – αλλά το κατηγορητήριο εναντίον τους παραμένει ολόκληρο.-->

<!--Οι ίδιοι μπορεί να μην το ξέρουν, αλλά αυτή η «διαχείριση» είναι παλιά για το ελληνικό κράτος / παρακράτος. Λέγεται δικαστική ομηρία. Μάλιστα, στη συγκεκριμένη περίπτωση, η μεθόδευση και η στόχευση είναι τόσο καθαρή όσο και ο σχεδιασμός που προηγήθηκε “παράγοντας” την ποινικοποίηση της αλληλεγγύης των εθελοντών διασωστών προς τους πρόσφυγες / μετανάστες που προσπαθούν να φτάσουν δια θαλάσσης σε ελληνικό έδαφος.-->

<!--Πρώτον, καθώς είναι υπόδικοι οι 4, είναι ριψοκίνδυνο να ξανα-ασχοληθούν με την διάσωση. Οποιαδήποτε στιγμή, αύριο ή σε μερικούς μήνες, μπορεί να ξανασυλληφθούν, με τις ίδιες ή παρόμοιες κατηγορίες. Αφού δεν έχουν αθωωθεί επίσημα το κατηγορητήριο είναι ενεργό.-->

<!--Δεύτερο, και σε σχέση με το προηγούμενο, η ισχύς του κατηγορητηρίου αφορά και τους υπόλοιπους εθελοντές που έχουν απομείνει στα ελληνικά νησιά, να «μπερδεύονται στα πόδια» των λιμενόμπατσων. Στον έβρο, που δεν υπάρχουν τέτοιοι πολίτες, η ελληνική αστυνομία ή/και ο στρατός κακοποιεί, κλέβει και ξαναπετάει κατά βούληση στο ποτάμι όσους πρόσφυγες / μετανάστες επιλέγει σαν «παράδειγμα» του είστε ανεπιθύμητοι και πρέπει να το νοιώσετε… Χωρίς μάρτυρες, ανεμπόδιστα… Το ελληνικό κράτος / παρακράτος επιστρέφει σταθερά σ’ αυτά που ξέρει από παλιά· βελτιωμένα: απ’ τα συνοριακά εγκλήματα κατά των μεταναστών απ’ την αλβανία, στα ‘90s…-->

<!--Εν τέλει, αν υπήρχε αυτό που ήταν απαραίτητο (όνειρα χειμερινής νυχτός!), δηλαδή ένα ικανό και επίμονο κίνημα συμπαράστασης στην Sara, στον Sean και στους υπόλοιπους, αυτό που θα έπρεπε να έχει σα στόχο δεν θα ήταν μόνο η αποφυλάκισή τους – αλλά η άμεση δίκη· και η αθώωσή τους.-->

<!--Το ελληνικό κράτος / παρακράτος, υπό τις φαιορόζ πολιτικές βιτρίνες, έχει εναρμονιστεί όσο περισσότερο μπορεί με την «γραμμή» που στην ιταλία εκφράζεται από ένα οριτζινάλ φασιστικό κάθαρμα, τον Salvini – αλλά και την γενική ιδέα της στρατιωτικοποίησης της Μεσογείου.-->

<!--Και την βγάζει «καθαρή». Αυτό, που ασφαλώς το χρεωνόμαστε πολιτικά και θα ήταν ξεφτίλα να παριστάνουμε ότι «δεν τρέχει τίποτα», είναι εξαιρετικά επικίνδυνη υποχώρηση.-->

<!--Που δεν χωράει καμμία δικαιολογία…-->
